glcloud/keil_v5/ARM/PACK/.Web/Keil.TMPM3_DFP.pdsc
          <book name="Documents/TMPM366FDXBG_datasheet_en_20130611.pdf"                     title="M366FDXBG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM366FWFG'  ***************************** -->
        <device Dname="TMPM366FWFG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM366.h"/>
          <debug svd="SVD/M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM366FWFG_datasheet_en_20130611.pdf" title="M366FWFG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM366FWXBG'  ***************************** -->
        <device Dname="TMPM366FWXBG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM366.h"/>
          <debug svd="SVD/M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/TMPM366FWXBG_datasheet_en_20130611.pdf" title="M366FWXBG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM366FYFG'  ***************************** -->
        <device Dname="TMPM366FYFG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM366.h"/>
          <debug svd="SVD/M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM366FYFG_datasheet_en_20130611.pdf" title="M366FYFG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM366FYXBG'  ***************************** -->
        <device Dname="TMPM366FYXBG">
          <processor Dclock="48000000"/>
          <compile header="Device/Include/TMPM366.h"/>
          <debug svd="SVD/M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/TMPM366FYXBG_datasheet_en_20130611.pdf" title="M366FYXBG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM367FDFG'  ***************************** -->
        <device Dname="TMPM367FDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM367.h"/>
          <debug svd="SVD/M367.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM367FDFG_datasheet_en_20131011.pdf" title="M367FDFG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

