glcloud/keil_v5/ARM/PACK/.Web/Keil.TMPM3_DFP.pdsc
          <!--book name="Documents/NotAvailable.pdf" title="TMPM367FYFG Reference Manual"/-->

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM367FYXBG'  ***************************** -->
        <device Dname="TMPM367FYXBG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM367.h"/>
          <debug svd="SVD/M367.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM367FYXBG Reference Manual"/-->

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM368FDFG'  ***************************** -->
        <device Dname="TMPM368FDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM368.h"/>
          <debug svd="SVD/M368.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM368FDFG_datasheet_en_20131024.pdf" title="M368FDFG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBD"          n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM368FDXBG'  ***************************** -->
        <device Dname="TMPM368FDXBG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM368.h"/>
          <debug svd="SVD/M368.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM368FDXBG_datasheet_en_20131024.pdf" title="M368FDXBG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBD"          n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="14"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="60"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM369FDFG'  ***************************** -->
        <device Dname="TMPM369FDFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM369.h"/>
          <debug svd="SVD/M369.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM369FDFG_datasheet_en_20131022.pdf" title="M369FDFG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBD"          n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ETH"           n="1"       m="100000000"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="102"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'TMPM369FDXBG'  ***************************** -->
        <device Dname="TMPM369FDXBG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM369.h"/>
          <debug svd="SVD/M369.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/TMPM369FDXBG_datasheet_en_20131018.pdf" title="M369FDXBG Reference Manual"/>

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBD"          n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ETH"           n="1"       m="100000000"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="102"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="177"/>
        </device>

        <!-- *************************  Device 'TMPM369FYFG'  ***************************** -->
        <device Dname="TMPM369FYFG">
          <processor Dclock="80000000"/>
          <compile header="Device/Include/TMPM369.h"/>
          <debug svd="SVD/M369.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010800" init   ="0" default="1"/>
          <algorithm name="Flash/TMPM36x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <!--book name="Documents/NotAvailable.pdf" title="TMPM369FYFG Reference Manual"/-->

          <feature type="DMA"           n="32"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="USART"         n="2"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="CAN"           n="1"/>
          <feature type="USBD"          n="1"/>
          <feature type="USBH"          n="1"                           name="USB Host (Full Speed)"/>
          <feature type="ETH"           n="1"       m="100000000"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="TimerOther"    n="4"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="Other"         n="4"                           name="CS/WAIT Controller"/>
          <feature type="RTC"           n="1"       m="32768"/>
          <feature type="IOs"           n="102"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="144"/>
        </device>

